In [1]:
import pandas as pd 
import numpy as np
from sklearn.preprocessing import LabelEncoder

In [2]:
df = pd.read_csv('Preprocess.csv')

In [3]:
df

  Employees   Age   Earned
0    Andrea  44.0  72000.0
1    Angela  27.0  48000.0
2    Rachel  30.0  54000.0
3   Rebecca  38.0  61000.0
4     Megan  40.0      NaN
5     Maria  35.0  58000.0
6    Nicola   NaN  52000.0
7     Sally  48.0  79000.0
8     Jeams  50.0  83000.0
9    Nabila  37.0  67000.0

# Filling the dataset with the mean value of the attribute

In [4]:
df.isnull().sum() #check null value

Employees    0
Age          1
Earned       1
dtype: int64

In [5]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [6]:
df['Earned'] = df['Earned'].fillna(df['Earned'].mean())

In [7]:
df

  Employees        Age        Earned
0    Andrea  44.000000  72000.000000
1    Angela  27.000000  48000.000000
2    Rachel  30.000000  54000.000000
3   Rebecca  38.000000  61000.000000
4     Megan  40.000000  63777.777778
5     Maria  35.000000  58000.000000
6    Nicola  38.777778  52000.000000
7     Sally  48.000000  79000.000000
8     Jeams  50.000000  83000.000000
9    Nabila  37.000000  67000.000000

In [8]:
df.isnull().sum()

Employees    0
Age          0
Earned       0
dtype: int64

# ***Encoding the Employees variable***

---

In [9]:
lab = LabelEncoder()

In [10]:
df['Employees']=lab.fit_transform(df['Employees'])

In [11]:
df

   Employees        Age        Earned
0          0  44.000000  72000.000000
1          1  27.000000  48000.000000
2          7  30.000000  54000.000000
3          8  38.000000  61000.000000
4          4  40.000000  63777.777778
5          3  35.000000  58000.000000
6          6  38.777778  52000.000000
7          9  48.000000  79000.000000
8          2  50.000000  83000.000000
9          5  37.000000  67000.000000

# ***Extracting independent and dependent  variable***

In [12]:
x = df.drop(['Earned'], axis=1) #independent 
y = df['Earned'] #dependent

In [13]:
x  #independent

   Employees        Age
0          0  44.000000
1          1  27.000000
2          7  30.000000
3          8  38.000000
4          4  40.000000
5          3  35.000000
6          6  38.777778
7          9  48.000000
8          2  50.000000
9          5  37.000000

In [14]:
y #dependent

0    72000.000000
1    48000.000000
2    54000.000000
3    61000.000000
4    63777.777778
5    58000.000000
6    52000.000000
7    79000.000000
8    83000.000000
9    67000.000000
Name: Earned, dtype: float64

# ***Splitting the dataset into training and test set***

In [15]:
from sklearn.model_selection import train_test_split as tts
xtrain, xtest, ytrain, ytest= tts(x, y, test_size= 0.2, random_state=0)

In [16]:
xtrain

   Employees        Age
4          4  40.000000
9          5  37.000000
1          1  27.000000
6          6  38.777778
7          9  48.000000
3          8  38.000000
0          0  44.000000
5          3  35.000000

In [17]:
xtest

   Employees   Age
2          7  30.0
8          2  50.0

# ***Feature Scaling***

In [18]:
from sklearn.preprocessing import StandardScaler

In [19]:
std = StandardScaler()

In [20]:
xtrain= std.fit_transform(xtrain)

In [21]:
xtrain

array([[-0.16903085,  0.26306757],
       [ 0.16903085, -0.25350148],
       [-1.18321596, -1.97539832],
       [ 0.50709255,  0.05261351],
       [ 1.52127766,  1.64058505],
       [ 1.18321596, -0.0813118 ],
       [-1.52127766,  0.95182631],
       [-0.50709255, -0.59788085]])

In [22]:
xtest= std.fit_transform(xtest)

In [23]:
xtest

array([[ 1., -1.],
       [-1.,  1.]])